RU/Version3/Files/day1-3/hotRoom/20x10x20mesh/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    floor
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
    ceiling
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
    fixedWalls
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
